app/views/tasks/index.html.erb

SELECT COUNT(*) FROM "participants" WHERE "participants"."task_id" = ?  [["task_id", 1]]
---
            <td><%= task.due.to_s[0...-4] %></td>
            <td><%= Participant.count_members(task) %></td>