app/controllers/members_controller.rb

	def create
	  @member = Member.new(member_params)
	  if @member.save
---
INSERT INTO "members" ("email", "phone", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def update
		@member = Member.find(params[:id])
		if @member.update(member_params)
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "members" SET "email" = ?, "phone" = ?, "last_name" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["email", "jimcarrey@gmail.com"], ["phone", "0000000000"], ["last_name", "Carrey"], ["updated_at", "2022-03-22 04:11:23.218028"], ["id", 2]]

	def destroy
		Member.find(params[:id]).destroy
		Participant.where(member_id: params[:id]).delete_all
---
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 1]]
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "participants" WHERE "participants"."member_id" = ?  [["member_id", 1]]