app/controllers/participants_controller.rb

INSERT INTO "participants" ("member_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["member_id", 1], ["task_id", 1], ["created_at", "2022-03-21 17:50:20.318826"], ["updated_at", "2022-03-21 17:50:20.318826"]]
SELECT "participants".* FROM "participants" WHERE "participants"."task_id" = ? AND "participants"."member_id" = ? LIMIT ?  [["task_id", 1], ["member_id", 1], ["LIMIT", 1]]
---
	def add_member
		Participant.find_or_create_by(task_id: params[:task], member_id: params[:member])

SELECT "participants".* FROM "participants" WHERE "participants"."task_id" = ? AND "participants"."member_id" = ? LIMIT ?  [["task_id", 4], ["member_id", 1], ["LIMIT", 1]]
DELETE FROM "participants" WHERE "participants"."task_id" = ? AND "participants"."member_id" = ?  [["task_id", 1], ["member_id", 1]]
---
	def remove_member
		Participant.where(task: params[:task], member: params[:member]).delete_all