app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY due DESC
---
	def index
		@tasks = Task.all

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "participants".* FROM "participants" WHERE "participants"."task_id" = ?  [["task_id", 1]]
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "members".* FROM "members"
---
	def show
		@task = Task.find(params[:id])

		@participants = []
		@members = []
		temp = Participant.where(task: @task)
		temp.each { |t| @participants.push(t.member) }
		temp = Member.all
		temp.each do |t|

INSERT INTO "tasks" ("name", "description", "start", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "asd"], ["description", ""], ["start", "2022-03-17 01:56:00"], ["created_at", "2022-03-21 17:56:37.485718"], ["updated_at", "2022-03-21 17:56:37.485718"]]
---
	def create
	  @task = Task.new(task_params)
	  if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "Build a website ><"], ["description", "By using reactjs!!!"], ["updated_at", "2022-03-22 04:09:49.368111"], ["id", 2]]
---
	def update
		@task = Task.find(params[:id])
		if @task.update(task_params)

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 5]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "participants" WHERE "participants"."task_id" = ?  [["task_id", 1]]
---
	def destroy
		Task.find(params[:id]).destroy
		Participant.where(task_id: params[:id]).delete_all