app/models/member.rb

	def self.all_info
		members = []
		self.all.each {|member| members.push(member.info)}
---
SELECT "members".* FROM "members"