app/models/participant.rb

SELECT "participants".* FROM "participants"
---
	def self.all_info
		records = []
		self.all.each {|p| records.push(p.info)}

SELECT COUNT(*) FROM "participants" WHERE "participants"."task_id" = ?  [["task_id", 2]]
---
	def self.count_members(task)
		return Participant.where(task_id: task).count

SELECT COUNT(*) FROM "participants" WHERE "participants"."member_id" = ?  [["member_id", 1]]
---
	def self.count_tasks(member)
		return Participant.where(member_id: member).count