app/models/task.rb

SELECT "tasks".* FROM "tasks"
---
	def self.all_info
		tasks = []
		self.all.each {|task| tasks.push(task.info)}