app/views/members/index.html.erb

          <td><%= member.to_s %></td>
          <td><%= Participant.count_tasks(member) %></td>
---
SELECT COUNT(*) FROM "participants" WHERE "participants"."member_id" = ?  [["member_id", 1]]