app/views/members/show.html.erb

SELECT "tasks".* FROM "tasks" INNER JOIN "participants" ON "tasks"."id" = "participants"."task_id" WHERE "participants"."member_id" = ?  [["member_id", 1]]
---
		<div class='list'>
			<% @member.tasks.each do |task| %>